nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt595/ota_examples/mcuboot_opensource/pin_mux.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v14.0
processor: MIMXRT595S
package_id: MIMXRT595SFFOC
mcu_data: ksdk2_0
processor_version: 14.0.0
pin_labels:
- {pin_num: P16, pin_signal: PIO4_5/FC7_SSEL2/FC1_TXD_SCL_MISO_WS, label: RESET_OSPI_MEM, identifier: RESET_OSPI_MEM}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitOSPIPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: P16, peripheral: GPIO, signal: 'PIO4, 5', pin_signal: PIO4_5/FC7_SSEL2/FC1_TXD_SCL_MISO_WS, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{

    /* Enables the clock for the GPIO4 module */
    CLOCK_EnableClock(kCLOCK_HsGpio4);

    gpio_pin_config_t RESET_OSPI_MEM_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO4_5 (pin P16)  */
    GPIO_PinInit(BOARD_INITPINS_RESET_OSPI_MEM_GPIO, BOARD_INITPINS_RESET_OSPI_MEM_PORT, BOARD_INITPINS_RESET_OSPI_MEM_PIN, &RESET_OSPI_MEM_config);

    const uint32_t RESET_OSPI_MEM = (/* Pin is configured as PIO4_5 */
                                     IOPCTL_PIO_FUNC0 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Disable input buffer function */
                                     IOPCTL_PIO_INBUF_DI |
                                     /* Normal mode */
                                     IOPCTL_PIO_SLEW_RATE_NORMAL |
                                     /* Normal drive */
                                     IOPCTL_PIO_FULLDRIVE_DI |
                                     /* Analog mux is disabled */
                                     IOPCTL_PIO_ANAMUX_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI);
    /* PORT4 PIN5 (coords: P16) is configured as PIO4_5 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_RESET_OSPI_MEM_PORT, BOARD_INITPINS_RESET_OSPI_MEM_PIN, RESET_OSPI_MEM);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitOSPIPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: T15, peripheral: FLEXSPI0, signal: FLEXSPI_DATA0, pin_signal: PIO1_20/FLEXSPI0_DATA0/SCT0_GPI1/CTIMER4_MAT1, pupdena: disabled, pupdsel: pullDown, ibena: enabled,
    slew_rate: normal, drive: full, amena: disabled, odena: disabled, iiena: disabled}
  - {pin_num: T14, peripheral: FLEXSPI0, signal: FLEXSPI_DATA1, pin_signal: PIO1_21/FLEXSPI0_DATA1/SCT0_OUT1/CTIMER4_MAT2, pupdena: disabled, pupdsel: pullDown, ibena: enabled,
    slew_rate: normal, drive: full, amena: disabled, odena: disabled, iiena: disabled}
  - {pin_num: R13, peripheral: FLEXSPI0, signal: FLEXSPI_DATA2, pin_signal: PIO1_22/FLEXSPI0_DATA2/SCT0_GPI2/CTIMER4_MAT3, pupdena: disabled, pupdsel: pullDown, ibena: enabled,
    slew_rate: normal, drive: full, amena: disabled, odena: disabled, iiena: disabled}
  - {pin_num: R12, peripheral: FLEXSPI0, signal: FLEXSPI_DATA3, pin_signal: PIO1_23/FLEXSPI0_DATA3/SCT0_OUT2/CTIMER_INP8, pupdena: disabled, pupdsel: pullDown, ibena: enabled,
    slew_rate: normal, drive: full, amena: disabled, odena: disabled, iiena: disabled}
  - {pin_num: N12, peripheral: FLEXSPI0, signal: FLEXSPI_DATA4, pin_signal: PIO1_24/FLEXSPI0_DATA4/SCT0_GPI3, pupdena: disabled, pupdsel: pullDown, ibena: enabled,
    slew_rate: normal, drive: full, amena: disabled, odena: disabled, iiena: disabled}
  - {pin_num: R14, peripheral: FLEXSPI0, signal: FLEXSPI_DATA5, pin_signal: PIO1_25/FLEXSPI0_DATA5/SCT0_OUT3, pupdena: disabled, pupdsel: pullDown, ibena: enabled,
    slew_rate: normal, drive: full, amena: disabled, odena: disabled, iiena: disabled}
  - {pin_num: P14, peripheral: FLEXSPI0, signal: FLEXSPI_DATA6, pin_signal: PIO1_26/FLEXSPI0_DATA6/SCT0_GPI4, pupdena: disabled, pupdsel: pullDown, ibena: enabled,
    slew_rate: normal, drive: full, amena: disabled, odena: disabled, iiena: disabled}
  - {pin_num: P13, peripheral: FLEXSPI0, signal: FLEXSPI_DATA7, pin_signal: PIO1_27/FLEXSPI0_DATA7/SCT0_OUT4, pupdena: disabled, pupdsel: pullDown, ibena: enabled,
    slew_rate: normal, drive: full, amena: disabled, odena: disabled, iiena: disabled}
  - {pin_num: T17, peripheral: FLEXSPI0, signal: FLEXSPI_SCLK, pin_signal: PIO1_18/FLEXSPI0_SCLK/SCT0_GPI0/CTIMER3_MAT3, pupdena: disabled, pupdsel: pullDown, ibena: enabled,
    slew_rate: normal, drive: full, amena: disabled, odena: disabled, iiena: disabled}
  - {pin_num: U16, peripheral: FLEXSPI0, signal: FLEXSPI_SS0_N, pin_signal: PIO1_19/FLEXSPI0_SS0_N/SCT0_OUT0/CTIMER4_MAT0/CLKOUT, pupdena: disabled, pupdsel: pullDown,
    ibena: enabled, slew_rate: normal, drive: full, amena: disabled, odena: disabled, iiena: disabled}
  - {pin_num: U14, peripheral: FLEXSPI0, signal: FLEXSPI_DQS, pin_signal: PIO1_28/FLEXSPI0_DQS/SCT0_GPI5, pupdena: enabled, pupdsel: pullDown, ibena: enabled, slew_rate: normal,
    drive: full, amena: disabled, odena: disabled, iiena: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

